---
kind: property
id: P:Autodesk.Revit.DB.Transform1D.Scale
source: html/7dd5f4ff-9add-8d76-6123-ebee2b193422.htm
---
# Autodesk.Revit.DB.Transform1D.Scale Property

The real number that represents the scale of this transformation.

## Syntax (C#)
```csharp
public double Scale { get; set; }
```